package arrayrithmetic;

public class ArrayArithmeticDemo2 {

  public static void main(String[] args) {
    //        如果数组元素不是基本类型，而是一个引用类型，那么，修改数组元素会有哪些不同？
    //
    //字符串是引用类型，因此我们先定义一个字符串数组
    String[] names = { "ABC", "XYZ", "zoo" };
  }
  //    对于String[]类型的数组变量names，它实际上包含3个元素，但每个元素都指向某个字符串对象：
  //              ┌─────────────────────────┐
  //    names │   ┌─────────────────────┼───────────┐
  //      │   │   │                     │           │
  //      ▼   │   │                     ▼           ▼
  //┌───┬───┬─┴─┬─┴─┬───┬───────┬───┬───────┬───┬───────┬───┐
  //│   │░░░│░░░│░░░│   │ "ABC" │   │ "XYZ" │   │ "zoo" │   │
  //└───┴─┬─┴───┴───┴───┴───────┴───┴───────┴───┴───────┴───┘
  //      │                 ▲
  //      └─────────────────┘
  //对names[1]进行赋值，例如names[1] = "cat";，效果如下：
  //
  //          ┌─────────────────────────────────────────────────┐
  //    names │   ┌─────────────────────────────────┐           │
  //      │   │   │                                 │           │
  //      ▼   │   │                                 ▼           ▼
  //┌───┬───┬─┴─┬─┴─┬───┬───────┬───┬───────┬───┬───────┬───┬───────┬───┐
  //│   │░░░│░░░│░░░│   │ "ABC" │   │ "XYZ" │   │ "zoo" │   │ "cat" │   │
  //└───┴─┬─┴───┴───┴───┴───────┴───┴───────┴───┴───────┴───┴───────┴───┘
  //      │                 ▲
  //      └─────────────────┘
  //这里注意到原来names[1]指向的字符串"XYZ"并没有改变，仅仅是将names[1]的引用从指向"XYZ"改成了指向"cat"，其结果是字符串"XYZ"再也无法通过names[1]访问到了。
}
